# Используем легковесный базовый образ для Go приложений
FROM golang:1.22-alpine AS builder

# Устанавливаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем go.mod и go.sum для загрузки зависимостей
COPY go.mod ./
COPY go.sum ./

# Загружаем Go-модули
RUN go mod download

# Копируем исходный код приложения
COPY . .

# Собираем приложение
# -o astracat-dns: имя исполняемого файла
# -ldflags "-s -w": уменьшает размер бинарника, удаляя отладочную информацию
# . : собираем код из текущей директории
RUN CGO_ENABLED=0 go build -o astracat-dns -ldflags "-s -w" .

# --- Начинаем второй этап сборки (Production-образ) ---
# Используем очень легкий базовый образ для итогового контейнера
FROM alpine:latest

# Устанавливаем рабочую директорию
WORKDIR /root/

# Копируем скомпилированный бинарник из предыдущего этапа
COPY --from=builder /app/astracat-dns .

# Открываем порт 5353 (UDP)
EXPOSE 5353/udp

# Команда, которая будет выполняться при запуске контейнера
# (./astracat-dns - это путь к вашему бинарнику внутри контейнера)
CMD ["./astracat-dns"]
